src/Catalogs/ЛогическиеПодсистемы/ЛогическиеПодсистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛогическиеПодсистемы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПолныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОтветственныеЛогическихПодсистем/ОтветственныеЛогическихПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛогическихПодсистем</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ЛогическаяПодсистема</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ЛогическиеПодсистемы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПрочитатьОтветственного();
	КонецЕсли;
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НастроитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьПоПодсистемеКонфигурации(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеПодбораОбъектов", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("ЛогическаяПодсистема", Объект.Ссылка);
	ОткрытьФорму("Справочник.ЛогическиеПодсистемы.Форма.ФормаПодбораОбъектов",
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьОтветственного()
	ЗначенияРесурсов = РегистрыСведений.ОтветственныеЛогическихПодсистем.ПолучитьПоследнее(,
		Новый Структура("ЛогическаяПодсистема", Объект.Ссылка));
	Ответственный = ЗначенияРесурсов.Ответственный;
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	Элементы.ГруппаСостав.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Состав,
		"ЛогическаяПодсистема",
		Объект.Ссылка,
		,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	Элементы.ФормаНазначитьОтветственного.Доступность = РольДоступна("ДобавлениеИзменениеЛогическихПодсистем");
		
КонецПроцедуры

&НаКлиенте
Процедура НазначитьОтветственного(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеНазначенияОтветственного", ЭтотОбъект);
	ЗначенияЗаполнения = Новый Структура("ЛогическаяПодсистема", Объект.Ссылка);
	ПараметрыНазначения = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму(
		"РегистрСведений.ОтветственныеЛогическихПодсистем.ФормаЗаписи",
		ПараметрыНазначения,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеНазначенияОтветственного(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ПрочитатьОтветственного();
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораОбъектов(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Истина Тогда
		Элементы.Состав.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
